Revit 2024 API
FabricArea.SketchId Property
 The id of the Sketch element for this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId SketchId { get; }
Visual Basic
Public ReadOnly Property SketchId As ElementId
	Get
Visual C++
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace